scripts/pH_wellMixed/constant/momentumTransport.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*simulationType LES;
LES
{
  model  NicenoKEqn;
  turbulence  on;
  printCoeff  on;

  delta       cubeRootVol;

    cubeRootVolCoeffs
    {
    }
    }*/

simulationType  RAS;
RAS
{
    model  mixtureKEpsilon;
    turbulence      on;
    printCoeffs     on;
    }

// ************************************************************************* //
