scripts/pH_wellMixed/constant/microbeUpdateProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      microbeUpdateProperties;
}

reaction_update_time [ 0 0 1 0 0 0 0 ] 3.0; //in hours
fluid_update_time    [ 0 0 1 0 0 0 0 ] 0.1;  //in seconds
initial_microbe_conc [ 0 -3 0 0 1 0 0] 0.507012833; //kg/m3 
initial_glucose      [ 0 -3 0 0 1 0 0] 588.8793734; //mol/m3 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
